package maven.lesson35;

// todo Maven (часть I)
// Maven - сборка проекта и управление зависимостями

// В больших проектах обычно бывает много зависимостей. Java проект можно собрать в .jar для обычных прилож) или .war (для веб прилож)
// Управление зависимостями, создание структуры проекта и сборкой можно заниматься вручную, но есть способ проще

// Apache Maven

            // Терминология
// Artifact - библиотека, готовый проект. Можно подключить к своему проекту. (JUnit, JDBC...). Мы тоже можем сделать проект и залить
// его на гитхаб и другие будут использовать его как артефакт к своим проектам.
// Зависимость - сторонная библиотека
// Apache Maven - (идиш Собирателей Знаний) - инструмент для сборки проекта и управление зависимостями

// Создадим новый проект как Maven проект ( выберем такой пункт когда будем создавать новый проект)
public class Lesson35 {
    public static void main(String[] args) {

    }
}
